{
  "architectures": [
    "GLAswaForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_gla_swa.GLAswaConfig",
    "AutoModelForCausalLM": "modeling_gla_swa.GLAswaForCausalLM"
  },
  "attention_dropout": 0.0,
  "attn_layers": [
    1,
    3,
    5,
    7,
    9,
    11,
    13,
    15,
    17,
    19,
    21,
    23,
    25,
    27
  ],
  "attn_mode": "chunk",
  "bos_token_id": 151643,
  "conv_size": 4,
  "elementwise_affine": true,
  "eos_token_id": 151643,
  "fuse_cross_entropy": true,
  "hidden_act": "swish",
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 131072,
  "model_type": "gla_swa",
  "norm_eps": 1e-06,
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rope_theta": 1000000.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.0",
  "use_cache": true,
  "use_short_conv": false,
  "vocab_size": 152064
}
